КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ВидыТоплива/КонтурЛогистика_ВидыТоплива.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ВидыТоплива</name>
  <enumValues>
    <name>AI80</name>
  </enumValues>
  <enumValues>
    <name>AI92</name>
  </enumValues>
  <enumValues>
    <name>AI95</name>
  </enumValues>
  <enumValues>
    <name>AI98</name>
  </enumValues>
  <enumValues>
    <name>ArcticDiesel</name>
  </enumValues>
  <enumValues>
    <name>Methane</name>
  </enumValues>
  <enumValues>
    <name>MidSeason</name>
  </enumValues>
  <enumValues>
    <name>Other</name>
  </enumValues>
  <enumValues>
    <name>Propane</name>
  </enumValues>
  <enumValues>
    <name>Winter</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ТипыТоплива/КонтурЛогистика_ТипыТоплива.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ТипыТоплива</name>
  <enumValues>
    <name>Biodiesel</name>
  </enumValues>
  <enumValues>
    <name>CompressedNaturalGas</name>
  </enumValues>
  <enumValues>
    <name>Diesel</name>
  </enumValues>
  <enumValues>
    <name>Electricity</name>
  </enumValues>
  <enumValues>
    <name>Gasoline</name>
  </enumValues>
  <enumValues>
    <name>LiquefiedPetroleumGas</name>
  </enumValues>
  <enumValues>
    <name>Other</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ВидыТоплива/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция СтрокаПоЗначению(Знач Значение) Экспорт
	
	Если Значение = Перечисления.КонтурЛогистика_ВидыТоплива.AI80 Тогда
		
		Возврат "AI80";
		
	ИначеЕсли Значение = Перечисления.КонтурЛогистика_ВидыТоплива.AI92 Тогда
		
		Возврат "AI92";
		
	ИначеЕсли Значение = Перечисления.КонтурЛогистика_ВидыТоплива.AI95 Тогда
		
		Возврат "AI95";
		
	ИначеЕсли Значение = Перечисления.КонтурЛогистика_ВидыТоплива.AI98 Тогда
		
		Возврат "AI98";
		
	ИначеЕсли Значение = Перечисления.КонтурЛогистика_ВидыТоплива.ArcticDiesel Тогда
		
		Возврат "ArcticDiesel";
		
	ИначеЕсли Значение = Перечисления.КонтурЛогистика_ВидыТоплива.Methane Тогда
		
		Возврат "Methane";
		
	ИначеЕсли Значение = Перечисления.КонтурЛогистика_ВидыТоплива.MidSeason Тогда
		
		Возврат "MidSeason";
		
	ИначеЕсли Значение = Перечисления.КонтурЛогистика_ВидыТоплива.Propane Тогда
		
		Возврат "Propane";
		
	ИначеЕсли Значение = Перечисления.КонтурЛогистика_ВидыТоплива.Winter Тогда
		
		Возврат "Winter";
		
	Иначе
		
		Возврат "Other";
		
	КонецЕсли;
	
КонецФункции

Функция ЗначениеДляXDTO(Значение, ВидТоплива) Экспорт
	
	Если Значение = Перечисления.КонтурЛогистика_ВидыТоплива.AI80 Тогда
		
		Результат = "1";
		
	ИначеЕсли Значение = Перечисления.КонтурЛогистика_ВидыТоплива.AI92 Тогда
		
		Результат =  "2";
		
	ИначеЕсли Значение = Перечисления.КонтурЛогистика_ВидыТоплива.AI95 Тогда
		
		Результат =  "3";
		
	ИначеЕсли Значение = Перечисления.КонтурЛогистика_ВидыТоплива.AI98 Тогда
		
		Результат =  "4";
		
	ИначеЕсли Значение = Перечисления.КонтурЛогистика_ВидыТоплива.ArcticDiesel Тогда
		
		Результат =  "3";
		
	ИначеЕсли Значение = Перечисления.КонтурЛогистика_ВидыТоплива.Methane Тогда
		
		Результат =  "2";
		
	ИначеЕсли Значение = Перечисления.КонтурЛогистика_ВидыТоплива.MidSeason Тогда
		
		Результат =  "1";
		
	ИначеЕсли Значение = Перечисления.КонтурЛогистика_ВидыТоплива.Propane Тогда
		
		Результат =  "1";
		
	ИначеЕсли Значение = Перечисления.КонтурЛогистика_ВидыТоплива.Winter Тогда
		
		Результат =  "2";
		
	Иначе
		
		Если ВидТоплива = Перечисления.КонтурЛогистика_ТипыТоплива.Gasoline Тогда
			Результат =  "5";
		ИначеЕсли ВидТоплива = Перечисления.КонтурЛогистика_ТипыТоплива.Diesel Тогда
			Результат =  "4";
		ИначеЕсли ВидТоплива = Перечисления.КонтурЛогистика_ТипыТоплива.CompressedNaturalGas Тогда
			Результат =  "3";
		Иначе
			ВызватьИсключение "Не удалось определить марку топлива";	
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗначениеИзXDTO(ЗначениеВидТоплива, ЗначениеМаркаТоплива) Экспорт
	
	Если ЗначениеВидТоплива = "1" Тогда 
		
		Если ЗначениеМаркаТоплива = "1" Тогда
			
			Результат = AI80;
			
		ИначеЕсли ЗначениеМаркаТоплива = "2" Тогда
			
			Результат = AI92;
			
		ИначеЕсли ЗначениеМаркаТоплива = "3" Тогда
			
			Результат = AI95;
			
		ИначеЕсли ЗначениеМаркаТоплива = "4" Тогда
			
			Результат = AI98;
			
		ИначеЕсли ЗначениеМаркаТоплива = "5" Тогда
			
			Результат = Other;
			
		КонецЕсли;
			
	ИначеЕсли ЗначениеВидТоплива = "2" Тогда 
		
		Если ЗначениеМаркаТоплива = "1" Тогда
			
			Результат = MidSeason;
			
		ИначеЕсли ЗначениеМаркаТоплива = "2" Тогда
			
			Результат = Winter;
			
		ИначеЕсли ЗначениеМаркаТоплива = "3" Тогда
			
			Результат = ArcticDiesel;
			
		ИначеЕсли ЗначениеМаркаТоплива = "4" Тогда
			
			Результат = Other;
			
		КонецЕсли;
		
	ИначеЕсли ЗначениеВидТоплива = "3" Тогда 
		
		Если ЗначениеМаркаТоплива = "1" Тогда
			
			Результат = Propane;
			
		ИначеЕсли ЗначениеМаркаТоплива = "2" Тогда
			
			Результат = Methane;
			
		ИначеЕсли ЗначениеМаркаТоплива = "3" Тогда
			
			Результат = Other;
			
		КонецЕсли;
		
	Иначе
		
		Результат = ПустаяСсылка();
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
